Revit 2027 API
ElectricalSetting.CircuitLoadCalculationMethod Property
 The method to calculate circuit load
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircuitLoadCalculationMethod CircuitLoadCalculationMethod { get; set; }
Public Property CircuitLoadCalculationMethod As CircuitLoadCalculationMethod
	Get
	Set
public:
property CircuitLoadCalculationMethod CircuitLoadCalculationMethod {
	CircuitLoadCalculationMethod get ();
	void set (CircuitLoadCalculationMethod value);
}
member CircuitLoadCalculationMethod : CircuitLoadCalculationMethod with get, set
Property Value
CircuitLoadCalculationMethod
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace